#Задание 1
print('Ну тут, полагаю, Вы справитесь :)')
#--------------------------------------------------------------------------------------------------
# Задание 2
time_s = int(input("Введите время в секундах: "))


time_h = int(time_s / 3600)
time_m = int((time_s / 60) - (time_h * 60))
time_s = int(time_s - (time_h * 3600) -(time_m * 60))

print(f"{time_h:02}:{time_m:02}:{time_s:02}")
#--------------------------------------------------------------------------------------------------
#Задание 3
n = input("Введите число: ")
print(int(n) + int(n + n) + int(n + n + n) )
#--------------------------------------------------------------------------------------------------
#Задание 4
n = int(input("Введите число: "))
max = 0

while n > 0:
    if max < (n % 10):
        max = (n % 10)

    n = int(n / 10)

print(f"max: {max}")
#--------------------------------------------------------------------------------------------------
#Задание 5
revenue = float(input("Введите выручку фирмы: "))
costs = float(input("Введите издержки фирмы: "))

if revenue > costs:
    print("Прибыль")
    profit = revenue / (revenue + costs)
    print("Рентабельность: %.2f" % profit)

    employees = int(input("Введите численность компании: "))
    print("Прибыль фирмы в расчете на каждого сотрудника: %.2f" % ((revenue - costs) / employees))
elif revenue < costs:
    print("Убыток")
else:
    print("В ноль")
#--------------------------------------------------------------------------------------------------
#Задание 6
a = float(input("Введите первый километраж спортсмена: "))
b = float(input("Введите предел: "))

days = 1

while a < b:
    print(f"{days}-й день: {round(a, 2)}")
    a = a * 1.1
    days += 1

print(f"{days}-й день: {round(a, 2)}")
print(f"На {days} день спортсмен достиг результата - не менее {b} км")
#--------------------------------------------------------------------------------------------------